In [1]:
import pandas as pd
table1 = pd.DataFrame({"ID": [1, 2, 3], "Name1":["A", "B", "C"]})
table2 = pd.DataFrame({"ID": [2, 3, 4], "Name2":["X", "Y", "Z"]})
table3 = pd.DataFrame({"Num": [2, 3, 4], "Name2":["X", "Y", "Z"]})

In [2]:
table1

   ID Name1
0   1     A
1   2     B
2   3     C

In [3]:
table2

   ID Name2
0   2     X
1   3     Y
2   4     Z

In [3]:
table1.merge(table2, how="inner")

   ID Name1 Name2
0   2     B     X
1   3     C     Y

In [4]:
table1.merge(table2, how="left")

   ID Name1 Name2
0   1     A   NaN
1   2     B     X
2   3     C     Y

In [5]:
table1.merge(table2, how="right")

   ID Name1 Name2
0   2     B     X
1   3     C     Y
2   4   NaN     Z

In [6]:
table1.merge(table2, how="outer")

   ID Name1 Name2
0   1     A   NaN
1   2     B     X
2   3     C     Y
3   4   NaN     Z

In [4]:
table1.merge(table3, left_on="ID", right_on="Num", how="inner")

   ID Name1  Num Name2
0   2     B    2     X
1   3     C    3     Y

In [8]:
table = pd.DataFrame({"Name":["A", "B", "A", "A", "C", "B"], "Age": [18, 20, 19, 15, 16, 17]})
table

  Name  Age
0    A   18
1    B   20
2    A   19
3    A   15
4    C   16
5    B   17

In [4]:
table.max()

Name     C
Age     20
dtype: object

In [11]:
table.groupby("Name").max()

      Age
Name
A      19
B      20
C      16

In [6]:
def find_oldest(row):
    return pd.Series({"MaxAge": row.Age.max()})
table.groupby("Name").apply(find_oldest)

      MaxAge
Name
A         19
B         20
C         16

In [14]:
table

  Name  Age
0    A   18
1    B   20
2    A   19
3    A   15
4    C   16
5    B   17

In [16]:
table2 = table.groupby("Name").Age.max().rename("MaxAge").reset_index()
table2

  Name  MaxAge
0    A      19
1    B      20
2    C      16

In [17]:
table.merge(table2, left_on="Name", right_on="Name", how="inner")

  Name  Age  MaxAge
0    A   18      19
1    A   19      19
2    A   15      19
3    B   20      20
4    B   17      20
5    C   16      16

In [22]:
# table.groupby("Name").Age.max()
table.groupby("Name").Age.apply(max)

Name
A    19
B    20
C    16
Name: Age, dtype: int64

In [23]:
table.groupby("Name").Age.transform(max)

0    19
1    20
2    19
3    19
4    16
5    20
Name: Age, dtype: int64

In [24]:
table['MaxAge'] = table.groupby("Name").Age.transform(max)
table

  Name  Age  MaxAge
0    A   18      19
1    B   20      20
2    A   19      19
3    A   15      19
4    C   16      16
5    B   17      20